---
kind: type
id: T:Autodesk.Revit.UI.Events.FormulaEditingEventArgs
source: html/67ae7e0e-00ff-4575-c39f-6b782e017f86.htm
---
# Autodesk.Revit.UI.Events.FormulaEditingEventArgs

The event arguments used by the DocumentSaving event.

## Syntax (C#)
```csharp
public class FormulaEditingEventArgs : RevitAPIPreEventArgs
```